Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/K13.tmx
Source language: en_us
Languages: zh_cn

source: The Entire Northern Side Was Covered with Fire
zh_cn: 北方着火了

source: People say no one reads anymore, but I find that's not the case. Prisoners read. I guess they're not given much access to computers.
zh_cn: 大家都说现如今已经没有人读书了，照我看，事实并非如此：囚犯们就还在阅读，我猜他们没什么机会可以用上电脑。

source: A felicitous injustice for me. The nicest reader letters I've received - also the only reader letters I've received - have come from prisoners.
zh_cn: 这样的不公平对我来说倒是恰到好处：我所收到的最好的，也是唯一的读者来信就是囚犯们写来的。

source: Maybe we're all prisoners? In our lives, our habits, our relationships?
zh_cn: 也许我们都不过是囚犯罢了，被关在自己的人生中，自己的习惯里，或者关在情爱关系中。

source: That's not nice, my saying that. Maybe it's even evil, to co-opt the misery of others.
zh_cn: 我这么说可能不太中听，甚至于有些恶毒，像这样子用别人的痛苦来说事儿。

source: I want to mention that, when I sold the movie, my husband had just left me.
zh_cn: 顺便提一句，我的电影卖出去的时候，我老公才刚刚离开我没几天。

source: I came home one day and a bunch of stuff was gone. I thought we'd been robbed.
zh_cn: 那天我回到家，发现家里很多东西不见了，我还以为我们被偷了。

source: Then I found a note: "I can't live here anymore." He had taken quite a lot with him.
zh_cn: 然后我看到一张字条：“我在这里住不下去了。”他可真是拿走了不少东西。

source: For example, we had a particularly nice Parmesan grater and he had taken that.
zh_cn: 我们有一个相当棒的干酪擦板，他带走了。

source: But he had left behind his winter coat.
zh_cn: 可他却把自己的厚衣服留了下来。

source: Also a child.
zh_cn: 还留下一个孩子。

source: We had a child together, sort of.
zh_cn: 我们共同拥有一个孩子，差不多可以这么说吧，在我的肚子里。

source: I was carrying it - girl or boy, I hadn't wanted to find out - inside me.
zh_cn: 也许是男孩，也许是女孩，我不太想知道。

source: I searched online for a replacement for that Parmesan grater, because I had really liked that Parmesan grater. It was the kind that works like a mill, not the kind you just scrape against; it had a handle that was fun to turn.
zh_cn: 我在网上逛了逛，想再买个一模一样的干酪擦板，说实话，我真是很喜欢那个擦板：它不是像擦菜板那样子把乳酪擦碎，而是把乳酪磨碎。它的把手转起来很有趣。

source: There were a number of similar graters available, but with unappealing "comfort" grips.
zh_cn: 网上有几个类似的擦板，不过它们都有所谓的“方便”把手，不合我的心意。

source: Finally, I found the same model.
zh_cn: 终于我找到了同一款擦板。

source: Was it premature to repurchase? Two days passed basically like that.
zh_cn: 现在是买新擦板的正确时机吗？不会太早了吗？两天时间就这么晃过去了。

source: Then, on Wednesday, my brother called. I gave him the update on my life.
zh_cn: 然后，周三那天，我弟弟打来电话，我告诉他老公走掉的事。

source: "Wow, that's really something," he said.
zh_cn: “哇，这可是件大事,”他说。

source: "Yeah. It is something."
zh_cn: “是啊，算是吧。”

source: Then he said, "I thought it was a work of fantasy, Trish. I mean, I guess I should have told you about it - "
zh_cn: 然后他说：“崔西，我想我该一早告诉你的，可我以为那不过是他的异想天开罢了。”

source: "What?"
zh_cn: “一早告诉我什么？”

source: "The blog," he said. "His blog. I-Can't-Stand-My-Wife-Dot-Blogspot-Dot-Com - " "Are you going through one of your sleepless phases again?"
zh_cn: “他的博客，”弟弟说：“他有个博客，叫我-再-也-受不了-我老婆-了。”“你是不是又睡不着觉了？”

source: "Trish, I know it makes me sound snoopy, but Jonathan always seemed a little off to me, you know? So after he left your apartment one time, when I was alone there, I don't know, I'm sorry, I opened up his laptop, and I looked through the browser history.
zh_cn: “崔西，我知道这么说显得我很八卦，但是我一直觉得乔纳森不太对劲，所以有一次他离开你的公寓后，只剩我一个人在那里，我也不知道怎么想的，就打开了他的手提电脑。

source: I was curious about his porn. I thought maybe there would be some really weird porn - "
zh_cn: 我翻看了他的浏览历史记录，本来是想看看他看些什么黄片，我还想着肯定有些相当古怪的货色呐。”

source: "There was weird porn?" "None at all, actually. Which in itself was kind of weird. No porn. Just his blog.
zh_cn: “那你找到古怪的黄片了吗？”“没有，一段都没找到，其实这本来就很可疑，我只看到了他的博客，”

source: And - " "All right. Well.
zh_cn: “好了，我知道了。

source: I'm thinking of buying a new Parmesan grater - " "I thought it was satire, Trish. To be honest, it's pretty funny.
zh_cn: 喂，我想再买一个干酪擦板。” “我以为他只是在开玩笑，崔西，老实说，那个看上去很好笑。

source: Look, I knew you could never have said some of that stuff. I mean, you are kind of critical, Trish, but still. How could I have known Jonathan was serious?
zh_cn: 我知道你永远不会说那种话，我的意思是，你这个人有点严肃，崔西，不过我怎么会知道乔纳森是玩真的呢？

source: I thought, Maybe these things can be healthy. Funny is healthy.
zh_cn: 我还想着这些东西可能是健康的，拿自己的生活开涮是件健康的事。

source: Maybe this is a healthy way for Jonathan to vent some anger, some hurt feelings.
zh_cn: 搞不好这是乔纳森发泄自己的愤怒或者不满的正确途径呐。

source: Healthy fantasy, you know? I didn't know what to do, Trish.
zh_cn: 健康的异想天开，你明白吗？我不知道该怎么办，崔西。

source: I asked my shrink. He wouldn't weigh in! I decided not to interfere.
zh_cn: 我问过我的心理医生，他不肯告诉我该怎么做，于是我决定不要介入。

source: Look, don't be mad at me, Trish, I'm just the traumatized bystander here - "
zh_cn: 崔西，别生我的气，我只不过是个受过伤害的该死的旁观者。”

source: "You know what's weird? You keep saying ¡Trish.'
zh_cn: “你知道哪里不对劲吗？你不停的叫我‘崔西’。

source: You do that when you're trying to avoid something.
zh_cn: 你只有想躲避什么的时候，才会不停地叫我的名字。

source: You should just come out and say whatever it is you want to say instead of saying ¡Trish' all the time."
zh_cn: 你想说什么就直说好了，不要不停地‘崔西’我。”

source: "Look, I'm going to come over and we're going to read it together. Or not. If that's what you want. Whatever you want."
zh_cn: “好吧，我马上过来，咱们一起看看他的博客，不看也行，听你的，你想怎么做就怎么做。”

source: I wasn't going to read the blog. So much writing out there in the world and who wants to read it? Not me.
zh_cn: 我不打算看什么博客，这个世界上充斥着如此多的文字，谁想看呢？反正我不想。

source: All of this was not long after the publication of my first novel, and I had some money, even a bit of dignity, as the novel had been somewhat successful; at least, I'd been given a decent advance and money from foreign rights, too
zh_cn: 这一切都发生在我的第一部小说出版后不久，小说算是成功了，我有了一点点钱，还有了一点点尊严。至少，我可以拿到像样的预付金了，还有外国版权。

source: - it was a dream! - but I didn't have lots of dignity and I didn't have lots of money, either, just some. (The novel was a love story, between a bird and a whale.)
zh_cn: 真是美梦一场啊！我没有很多钱，也没有很多尊严，只有一些钱和一些尊严。（我的小说写了一只鸟和一条鲸鱼之间的爱情故事。）

source: Why was I already low on money?
zh_cn: 我为什么很快又没钱了呢？

source: Partially because money just flies, as they say, or I guess it's time they say that about, the flying, but money, too - very winged.
zh_cn: 部分原因就像人们说的，钱会飞，不对，人们说的是时间会飞，其实钱也是长着翅膀会飞走的。

source: Still, one of the main reasons I didn't have much money was that I had been paying my husband's way through business school.
zh_cn: 我没有很多钱的主要原因是我一直在为我的老公付商学院的学费。

source: At least, I'd thought I was doing that, but it turned out he wasn't enrolled in school - I went to look for him, of course - and he had just been making those "tuition" withdrawals for himself.
zh_cn: 至少我以为我付的是学费，但事实是当我去学校找他时，才知道他压根没被录取。他提走的“学费”都自己花了。

source: He did have many nice qualities, my husband.
zh_cn: 他有不少优点，我的老公。

source: His hair unwashed was divine.
zh_cn: 他脏兮兮的头发看上去可爱极了。

source: He never asked me what I'd gotten done on any particular day.
zh_cn: 他从不问我哪天干了什么事。

source: We'd fallen madly in love in three weeks; that was fun.
zh_cn: 只用了三个星期我们就疯狂地坠入爱河；真有意思。

source: He used to call me "little chicken."
zh_cn: 他过去叫我“小母鸡。”

source: I still miss him.
zh_cn: 我仍然想念他。

source: But back to the point. I had some money but not lots of money.
zh_cn: 言归正传吧，我有了一些钱，但是没有很多钱。

source: Prison bars of not-money grew around me in dreams, like wild magic corn.
zh_cn: 缺钱花的感觉像监狱栏杆一样在我的梦中生长，像野生的魔法玉米一样疯长着。

source: My agent called - so nice to be called by a friend! . . .
zh_cn: 我的经纪人来电话了，有朋友打来电话真是件好事。......

source: Or, no, not a friend . . . but sort of a friend - to see if I was interested in taking a meeting with some "movie people."
zh_cn: 不，不对，不是朋友 ......或者说类似朋友吧，他问我有没有兴趣和电影圈的人见个面。

source: I started crying, and then we got past that.
zh_cn: 我哭了起来，然后我们若无其事地继续谈下去。

source: The meeting would just be to talk over a few notions, no biggie, but maybe.
zh_cn: 会面时大家也就是提几个点子，没什么大不了的，不过也不一定。

source: They had liked the screenplay adaptation of my novel - I hadn't written a screenplay adaptation, this seemed to be a confusion - but thought it would be too expensive to have underwater filming and also flight filming.
zh_cn: 他们喜欢改编自我小说的剧本——我还没改写呐，可能弄错了——但他们认为拍水下戏和空中戏都太费钱了。

source: They wanted a cheaper love story.
zh_cn: 他们想要一个低成本的爱情片。

source: What if it was two land animals? Anyway, a meeting was proposed.
zh_cn: 改成两只陆地动物怎么样？总之，会面约好了。

source: My agent acted as if I might find it beneath me, like only another novel was serious work, and even though I know he didn't really think that - didn't really think that my writing was too serious to be set aside for a movie - I thought it was nice of him to pretend as if that might be the case.
zh_cn: 我的经纪人表现得好像这么做我会认为降低了我的身份似地，好像只有别人的作品才是严肃小说。尽管我知道他并不这么想，不是真认为我的小说严肃到不该被随意改编成电影，但我喜欢他的装腔作势。

source: "Great, great," I said, in a closing voice. "I'm, you know, all over that, totally."
zh_cn: “好啦，好啦，”我回答道，声音紧巴巴的，“你知道，我已经没事了，百分百。”

source: "Totally?"
zh_cn: “真是百分百？”

source: I coughed, as if to locate the problem in my throat.
zh_cn: 我咳了几声，似乎想弄明白究竟喉咙哪里出了问题。

source: "So you're O.K.?"
zh_cn: “也就是说你的心情已经恢复了？”

source: "Excited. I'll be there."
zh_cn: “简直兴奋极了，我会准时到的。”

source: "Like even what's just happened to you - that's an idea right there."
zh_cn: “就好比刚刚发生在你身上的这件事，那可以是个不错的点子。”

source: And it struck me that maybe the meeting was the kind of thing that was going to save me, or at least that I should not entirely neglect to prepare for it, since it might kind of sort of save me a little bit.
zh_cn: 我突然意识到，这次会面可能正是我的救世主之类的东西，至少，我不该对它不理不睬，该为它做些准备。没准儿它能或多或少帮到我。

source: It could be a very good thing.
zh_cn: 它或许能变成一件好事。

source: I could watch myself put forward my best effort and then feel good about myself for having done so, for having tried.
zh_cn: 我似乎看到自己使出了浑身的劲来准备，然后为自己努力了而感到满意，对自己感到满意。

source: The least I could do - for me, and for my progeny, too! - was open up a Word file.
zh_cn: 我应该打开一个word文档，我至少可以为自己做这件事，当然也是为我的孩子。

source: Or, failing that, jot down a few notes on a legal pad.
zh_cn: 也许不用打开word文档，我可以直接在拍纸簿上记下一些好点子。

source: Let me just say now, because I don't believe in suspense - or at least I feel dirty when I try to engage in it, probably mostly because I'm no good at it - that I didn't prepare for the meeting at all.
zh_cn: 干脆直说吧，我压根就没为这次会面做任何准备，我不喜欢悬而未决的事情，当我试图投身其中的时候，会觉得自己很不地道，也许最大的原因是我根本就不擅长推销。

source: My friend David came by - he needed to borrow money, he had much worse luck in life than I did, also expensive dental problems, and an addiction to acupuncture - and I told him about the leaving and also about the blog.
zh_cn: 我的朋友大卫来家里坐了坐，他想和我借些钱。这家伙挣钱的运气比我差得多，可他的牙齿却需要看贵得要死的牙医，他还对针灸疗法上了瘾。

source: David already knew about the blog. He, too, had found it by going through the browser history of Jonathan's laptop.
zh_cn: 我告诉他乔纳森离开的事，还有那个博客。大卫已经知道那个博客了，他也是在翻查乔纳森手提电脑的浏览历史时看到的。

source: "The guy had a pretty amazing imagination," David said. "I wouldn't have guessed it. I suppose we should respect that."
zh_cn: “那家伙的想象力充沛着呐！”大卫说：“我可真是没想到，我猜咱们该尊重这一点。”

source: "You didn't want to tell me?"
zh_cn: “你就没想着告诉我一声吗？”

source: "Remember the two months you didn't speak to me when I said you were rash for getting married so fast?"
zh_cn: “当初我说你这么快结婚有些鲁莽，你两个月没和我说话，你不记得了？”

source: I had recently heard someone use the word "poleaxed." That word made me think back to those years in Kentucky as a child - I don't know why, that was the thought.
zh_cn: 最近我听到有人在用“poleaxed”（好像被斧头砍到一样的震惊）这个词，它使我想起在肯塔基的童年时光，我也不知道为什么，就这么联想到了。

source: I was a fancy citified woman now, and so my life could have properly sized disasters, ones in the comedy-of-manners way of things, rather than in the losing-a-limb-to-a-tractor-blade way of things; that was another thought.
zh_cn: 我的另外一个联想是这样的：现如今的我是一名时髦的都市女性，我生活中可能面临的灾难多半会以风俗喜剧的形式出现，而不大可能是被刀锋砍掉手脚这个类型的。

source: If there was no blood on the floor, then it wasn't a tragedy.
zh_cn: 如果地板上没有血迹，那么这就不能算是一场悲剧。

source: That was what "urban" meant. Could mean.
zh_cn: 这就是“城市”的本意。应该可以这样说吧。

source: Poleaxed.
zh_cn: 好像被斧头砍到一样的震惊。

source: I had also once come across a phrase about a book "lying like a poleaxed wildebeest in the middle of my life."
zh_cn: 我看到过这样一个词组，用来形容一本书的，“好像被斧头砍倒的羚羊一样躺在我的生活当中”。

source: It was my life that was lying in the middle of my life like that, like a poleaxed wildebeest.
zh_cn: 我此时此刻的生活就像被斧头砍倒的羚羊一样躺在我的生活当中。

source: "We were still sleeping together," I said. "People don't sleep with people they hate."
zh_cn: “我们可一直一起睡的，”我说：“人不会和自己憎恨的人睡吧。”

source: "Interesting," David said. "Verifiably false.
zh_cn: “有意思，”大卫说：“那不过说明他是个伪君子罢了。

source: Possibly irrelevant, regardless."
zh_cn: 或者什么也说明不了，根本和他离开你这件事没有什么关系。”

source: David was an aspiring screenwriter and my most reliable friend.
zh_cn: 大卫是个胸怀大志的编剧，也是我最信赖的朋友。

source: I didn't tell him about my upcoming movie meeting. The mood of betrayal had gone general.
zh_cn: 我没告诉他我要和电影圈的人会面的事，我满脑子想的都是被欺骗这件事。

source: "Men like me," I said, hand on the belly that housed a being of unknown gender.
zh_cn: “男人们还是喜欢我的，”我说道，手放在小腹上，里面是性别不明的小生命。

source: "They really do.
zh_cn: “他们的的确确是喜欢我的。

source: Just yesterday a man stopped me on the sidewalk to ask me if I was Italian."
zh_cn: 昨天还有个男人在人行道上截住我，问我是不是意大利人。”

source: "Who was talking about not liking you? You're just in pain."
zh_cn: “谁说你不讨男人喜欢了？你不过是在痛苦罢了。”

source: "Maybe I'm not in pain."
zh_cn: “也许这不是痛苦。”

source: "I'd put my money on pain.
zh_cn: “要是我的话，就花钱去找点乐子。

source: It's the Kantian sublime, what you're experiencing.
zh_cn: 你现在正在体验的就是康德之崇高【Kantian sublime 译注】。

source: There's your life, and then you get a glimpse of the vastness of the unknown all around that little itty-bitty island of the known."
zh_cn: 这就是你的人生，然后你会一瞥被围绕在了无边际的未知世界当中的小小的已知岛屿。”

source: A silence ate at the air in the room.
zh_cn: 寂静吞噬着房间里的空气。

source: Sublime.
zh_cn: 崇高。

source: I thought of it as a flavor.
zh_cn: 我好像在思考一种口味一样地想着这个词。

source: Maybe related to Key lime.
zh_cn: 也许和青柠檬口味的有关【sublime和keylime有同样的后缀 译注】。

source: I didn't know what the Kantian sublime was.
zh_cn: 我不知道康德之崇高指的是什么。

source: It's important to be an attentive host. And wife, for that matter.
zh_cn: 不过做个热情的主人可是件重要的事，就好像应该做个热情的妻子一样地重要。

source: I went to the kitchen and got out some crackers and mustard and jam; it was what I had.
zh_cn: 我去厨房拿出一些饼干、芥末酱和果酱。我只有这些吃的。

source: I found some little decorative plates to make it look nicer.
zh_cn: 然后找了几个漂亮的小盘子，把它们摆得漂漂亮亮的。

source: Suddenly I was worried that David might leave, that I'd have no friends left in the world.
zh_cn: 突然之间，我担心大卫会离开我，这样的话我在这个世界上就没有朋友了。

source: "You know who I get fan letters from?" I said, as if pulling out a deck of cards to do a magic trick. "I do get fan letters. That's something, isn't it? Maybe there's a certain distance from which I am lovable.
zh_cn: “你知道我收到什么样的书迷寄来的信了吗？”我问道，好像拿出一副扑克牌准备变戏法一样，“我的确收到书迷来信了，这挺了不起的，对吧？也许在一定的距离之外，我是可爱的。

source: I get fan letters only from men.
zh_cn: 我收到的书迷信都是男人写来的。

source: Only from men in prison."
zh_cn: 都是正在坐牢的男犯人。”

source: I set down the confused cracker offering.
zh_cn: 我把那几碟内容含混不清的饼干摆在桌上。

source: "You really haven't looked at the blog?" David let the crackers just sit there. "On the one hand, I want to congratulate you, but it might not be healthy, not looking."
zh_cn: “你真的没看那个博客吗？”大卫没理睬那些饼干；“一方面我想恭喜你，不过我也担心你压根不去看可不是健康的表现。”

source: I spread mustard on a cracker, and pretended not to have heard anything.
zh_cn: 我把芥末酱摊在饼干上，假装什么都没有听到。

source: "I used to get fan letters from prisoners, too," David said. "Back when I ghostwrote that column for Hustler."
zh_cn: “我也收到过犯人寄来的书迷信”，大卫说，“就是我做枪手为《好色客》写专栏的时候。”

source: "You're not actually competing with me on this, are you?"
zh_cn: “你不是要和我比个高低吧？”

source: "I'm just sharing. This is intimacy, Trish."
zh_cn: “我不过是和你分享罢了，这可是我的隐私，崔西。”

source: "One of the letters - it was, like, seven pages long - was about love.
zh_cn: “其中有一封信，七页纸那么长，是关于爱情的。

source: Like a lengthy philosophical inquiry into the nature of love as written by a very smart fifteen-year-old.
zh_cn: 好像一个非常聪明的15岁男孩写的探索爱情本质的哲学论文。

source: Not sex, but love.
zh_cn: 不关性的事，只是爱情。

source: He said that, like, seven times.
zh_cn: 这句话他大概重复了七遍。

source: Maybe that means it was about sex. Anyhow. About love."
zh_cn: 也许这恰恰意味着和性有关，爱情和性是有关的。”

source: "Don't make that sex-love distinction in front of other people. It's not becoming."
zh_cn: “你可别在其他人面前谈论什么性和爱的区别，太老土了！

source: Life, I was deciding, was a series of stumblings into the Kantian sublime. Not that I knew one sublime from another, as I said, but I planned on asking David about that when I was feeling less vulnerable.
zh_cn: 我觉得，人生就是撞进一个接一个的康德之崇高当中，前面我也说过了，我分不清楚这口味那口味的，我打算在自己没有这么脆弱的时候问问大卫，问问他什么是康德之崇高。

source: "Well, this kid said he wanted to confirm with me some impressions about love which he had gotten from my book.
zh_cn: “这个孩子在信里说，他想确认一下他从我的书中得到的一些关于爱情的印象。
